-- phpMyAdmin SQL Dump
-- version 4.0.10deb1
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: Apr 13, 2018 at 05:23 PM
-- Server version: 5.5.52-0ubuntu0.14.04.1-log
-- PHP Version: 5.5.9-1ubuntu4.20

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `db_amis`
--

-- --------------------------------------------------------

--
-- Table structure for table `tbl_units`
--

CREATE TABLE IF NOT EXISTS `tbl_units` (
  `id` int(4) unsigned NOT NULL AUTO_INCREMENT,
  `division_id` int(4) unsigned NOT NULL COMMENT 'This field value come from tbl_division',
  `division_code` int(11) NOT NULL,
  `unit_code` varchar(100) NOT NULL COMMENT 'code of particuler district or zone',
  `unit_name_eng` varchar(50) CHARACTER SET utf8 DEFAULT NULL,
  `unit_name_bng` varchar(100) CHARACTER SET utf8 DEFAULT NULL,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `created_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  PRIMARY KEY (`id`),
  KEY `division_id_unit_info` (`division_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=latin1 AUTO_INCREMENT=74 ;

--
-- Dumping data for table `tbl_units`
--

INSERT INTO `tbl_units` (`id`, `division_id`, `division_code`, `unit_code`, `unit_name_eng`, `unit_name_bng`, `updated_at`, `created_at`) VALUES
(0, 0, 0, '0', 'na', 'na', '2016-02-17 10:48:01', '0000-00-00 00:00:00'),
(1, 4, 40, '1', 'BAGERHAT', 'বাগেরহাট', '2015-12-08 10:08:58', '0000-00-00 00:00:00'),
(2, 5, 20, '3', 'BANDARBAN', 'বান্দরবান', '2015-12-08 10:08:58', '0000-00-00 00:00:00'),
(3, 6, 10, '4', 'BARGUNA', 'বরগুনা', '2015-12-08 10:08:58', '0000-00-00 00:00:00'),
(4, 6, 10, '6', 'BARISAL', 'বরিশাল', '2015-12-08 10:08:58', '0000-00-00 00:00:00'),
(5, 6, 10, '9', 'BHOLA', 'ভোলা', '2015-12-08 10:08:58', '0000-00-00 00:00:00'),
(6, 3, 50, '10', 'BOGRA', 'বগুড়া', '2015-12-08 10:08:58', '0000-00-00 00:00:00'),
(7, 11, 25, '12', 'BRAHMANBARIA', 'বি-বাড়ীয়া', '2016-11-15 10:39:36', '0000-00-00 00:00:00'),
(8, 11, 25, '13', 'CHANDPUR', 'চাঁদপুর', '2016-11-15 10:40:11', '0000-00-00 00:00:00'),
(9, 5, 20, '15', 'CHITTAGONG', 'চট্টগ্রাম', '2015-12-08 10:08:58', '0000-00-00 00:00:00'),
(10, 4, 40, '18', 'CHUADANGA', 'চুয়াডাংগা', '2015-12-08 10:08:58', '0000-00-00 00:00:00'),
(11, 11, 25, '19', 'COMILLA', 'কুমিল্লা', '2016-11-15 10:40:33', '0000-00-00 00:00:00'),
(12, 5, 20, '22', 'COXS BAZAR', 'কক্সবাজার', '2015-12-08 10:08:59', '0000-00-00 00:00:00'),
(13, 8, 30, '26', 'DHAKA', 'ঢাকা', '2015-12-08 10:08:59', '0000-00-00 00:00:00'),
(14, 2, 55, '27', 'DINAJPUR', 'দিনাজপুর', '2015-12-08 10:08:59', '0000-00-00 00:00:00'),
(15, 8, 30, '29', 'FARIDPUR', 'ফরিদপুর', '2015-12-08 10:08:59', '0000-00-00 00:00:00'),
(16, 11, 25, '30', 'FENI', 'ফেনী', '2016-11-15 10:40:56', '0000-00-00 00:00:00'),
(17, 2, 55, '32', 'GAIBANDHA', 'গাইবান্ধা', '2015-12-08 10:08:59', '0000-00-00 00:00:00'),
(18, 8, 30, '33', 'GAZIPUR', 'গাজীপুর', '2015-12-08 10:08:59', '0000-00-00 00:00:00'),
(19, 8, 30, '35', 'GOPALGANJ', 'গোপালগঞ্জ', '2015-12-08 10:08:59', '0000-00-00 00:00:00'),
(20, 1, 60, '36', 'HABIGANJ', 'হবিগঞ্জ', '2016-10-23 15:51:54', '0000-00-00 00:00:00'),
(21, 3, 50, '38', 'JOYPURHAT', 'জয়পুরহাট', '2016-10-24 05:58:31', '0000-00-00 00:00:00'),
(22, 12, 12, '39', 'JAMALPUR', 'জামালপুর', '2016-11-22 06:30:30', '0000-00-00 00:00:00'),
(23, 4, 40, '41', 'JESSORE', 'যশোর', '2015-12-08 10:08:59', '0000-00-00 00:00:00'),
(24, 6, 10, '42', 'JHALOKATI', 'ঝালকাঠি', '2016-10-20 10:53:46', '0000-00-00 00:00:00'),
(25, 4, 40, '44', 'JHENAIDAH', 'ঝিনাইদহ', '2015-12-08 10:08:59', '0000-00-00 00:00:00'),
(26, 5, 20, '46', 'KHAGRACHHARI', 'খাগড়াছড়ি', '2015-12-08 10:08:59', '0000-00-00 00:00:00'),
(27, 4, 40, '47', 'KHULNA', 'খুলনা', '2015-12-08 10:08:59', '0000-00-00 00:00:00'),
(28, 8, 30, '48', 'KISHOREGONJ', 'কিশোরগঞ্জ', '2016-11-30 05:02:24', '0000-00-00 00:00:00'),
(29, 2, 55, '49', 'KURIGRAM', 'কুড়িগ্রাম', '2015-12-08 10:09:00', '0000-00-00 00:00:00'),
(30, 4, 40, '50', 'KUSHTIA', 'কুষ্টিয়া', '2015-12-08 10:09:00', '0000-00-00 00:00:00'),
(31, 11, 25, '51', 'LAKSHMIPUR', 'লক্ষ্মীপুর', '2016-11-15 10:41:40', '0000-00-00 00:00:00'),
(32, 2, 55, '52', 'LALMONIRHAT', 'লালমনিরহাট', '2015-12-08 10:09:00', '0000-00-00 00:00:00'),
(33, 8, 30, '54', 'MADARIPUR', 'মাদারীপুর', '2016-10-20 10:59:43', '0000-00-00 00:00:00'),
(34, 4, 40, '55', 'MAGURA', 'মাগুড়া', '2015-12-08 10:09:00', '0000-00-00 00:00:00'),
(35, 8, 30, '56', 'MANIKGANJ', 'মানিকগঞ্জ', '2015-12-08 10:09:00', '0000-00-00 00:00:00'),
(36, 4, 40, '57', 'MEHERPUR', 'মেহেরপুর', '2015-12-08 10:09:00', '0000-00-00 00:00:00'),
(37, 1, 60, '58', 'MAULVIBAZAR', 'মৌলভীবাজার', '2016-11-30 05:02:04', '0000-00-00 00:00:00'),
(38, 8, 30, '59', 'MUNSHIGANJ', 'মুন্সীগঞ্জ', '2016-10-19 07:52:29', '0000-00-00 00:00:00'),
(39, 12, 12, '61', 'MYMENSINGH', 'ময়মনসিংহ', '2016-11-22 06:30:53', '0000-00-00 00:00:00'),
(40, 3, 50, '64', 'NAOGAON', 'নওগাঁ', '2016-10-27 11:16:23', '0000-00-00 00:00:00'),
(41, 4, 40, '65', 'NARAIL', 'নড়াইল', '2015-12-08 10:09:00', '0000-00-00 00:00:00'),
(42, 8, 30, '67', 'NARAYANGANJ', 'নারায়নগঞ্জ', '2015-12-08 10:09:00', '0000-00-00 00:00:00'),
(43, 8, 30, '68', 'NARSINGDI', 'নরসিংদী', '2015-12-08 10:09:00', '0000-00-00 00:00:00'),
(44, 3, 50, '69', 'NATORE', 'নাটোর', '2015-12-08 10:09:00', '0000-00-00 00:00:00'),
(45, 3, 50, '70', 'CHAPAI NABABGANJ', 'চাপাইনবাবগঞ্জ', '2015-12-08 10:09:00', '0000-00-00 00:00:00'),
(46, 12, 12, '72', 'NETRAKONA', 'নেত্রকোনা', '2016-11-22 06:31:25', '0000-00-00 00:00:00'),
(47, 2, 55, '73', 'NILPHAMARI', 'নীলফামারী', '2015-12-08 10:09:01', '0000-00-00 00:00:00'),
(48, 11, 25, '75', 'NOAKHALI', 'নোয়াখালী', '2016-11-15 10:42:04', '0000-00-00 00:00:00'),
(49, 3, 50, '76', 'PABNA', 'পাবনা', '2015-12-08 10:09:01', '0000-00-00 00:00:00'),
(50, 2, 55, '77', 'PANCHAGARH', 'পঞ্চগড়', '2016-10-20 10:56:29', '0000-00-00 00:00:00'),
(51, 6, 10, '78', 'PATUAKHALI', 'পটুয়াখালী', '2015-12-08 10:09:01', '0000-00-00 00:00:00'),
(52, 6, 10, '79', 'PIROJPUR', 'পিরোজপুর', '2015-12-08 10:09:01', '0000-00-00 00:00:00'),
(53, 3, 50, '81', 'RAJSHAHI', 'রাজশাহী', '2015-12-08 10:09:01', '0000-00-00 00:00:00'),
(54, 8, 30, '82', 'RAJBARI', 'রাজবাড়ী', '2015-12-08 10:09:01', '0000-00-00 00:00:00'),
(55, 5, 20, '84', 'RANGAMATI', 'রাঙামাটি ', '2016-10-27 12:03:50', '0000-00-00 00:00:00'),
(56, 2, 55, '85', 'RANGPUR', 'রংপুর', '2015-12-08 10:09:01', '0000-00-00 00:00:00'),
(57, 8, 30, '86', 'SHARIATPUR', 'শরীয়তপুর', '2016-10-24 05:37:33', '0000-00-00 00:00:00'),
(58, 4, 40, '87', 'SATKHIRA', 'সাতক্ষীরা', '2015-12-08 10:09:01', '0000-00-00 00:00:00'),
(59, 3, 50, '88', 'SIRAJGANJ', 'সিরাজগঞ্জ', '2016-10-20 10:54:47', '0000-00-00 00:00:00'),
(60, 12, 12, '89', 'SHERPUR', 'শেরপুর', '2016-11-22 06:31:45', '0000-00-00 00:00:00'),
(61, 1, 60, '90', 'SUNAMGANJ', 'সুনামগঞ্জ', '2015-12-08 10:09:01', '0000-00-00 00:00:00'),
(62, 1, 60, '91', 'SYLHET', 'সিলেট', '2015-12-08 10:09:01', '0000-00-00 00:00:00'),
(63, 8, 30, '93', 'TANGAIL', 'টাংগাইল', '2015-12-08 10:09:01', '0000-00-00 00:00:00'),
(64, 2, 55, '94', 'THAKURGAON', 'ঠাকুরগাঁও', '2016-10-20 10:57:12', '0000-00-00 00:00:00'),
(65, 8, 30, '104', 'DHAKAADMIN', 'ঢাকা(প্রশাসনিক)', '2016-10-29 10:49:28', '0000-00-00 00:00:00'),
(66, 9, 0, '105', 'DHAKANORTH', 'ঢাকা(উত্তর)', '2016-10-29 10:48:13', '0000-00-00 00:00:00'),
(67, 9, 0, '106', 'DHAKASOUTH', 'ঢাকা(দক্ষিণ)', '2016-10-29 10:49:52', '0000-00-00 00:00:00'),
(68, 9, 0, '107', 'DHAKAEAST', 'ঢাকা(পূর্ব)', '2016-10-29 10:50:08', '0000-00-00 00:00:00'),
(69, 9, 0, '108', 'DHAKAWEST', 'ঢাকা(পশ্বিম)', '2016-10-29 10:50:21', '0000-00-00 00:00:00'),
(70, 10, 0, '101', 'CHITTAGONGNORTH', 'চট্টগ্রাম মহানগর(উত্তর)জোন,চট্টগ্রাম', '2016-10-29 10:50:50', '0000-00-00 00:00:00'),
(71, 10, 0, '103', 'CHITTAGONGSOUTH', 'চট্টগ্রাম মহানগর(দক্ষিন)জোন,চট্টগ্রাম', '2016-10-29 10:51:02', '0000-00-00 00:00:00'),
(72, 5, 20, '102', 'CHITTAGONGADMIN', 'জেলা কমান্ড্যান্ট চট্টগ্রাম', '2015-12-08 10:09:02', '0000-00-00 00:00:00'),
(73, 8, 30, '109', 'HQ', 'HQ', '2015-12-31 06:52:54', '0000-00-00 00:00:00');

DELIMITER $$
--
-- Events
--
CREATE DEFINER=`root`@`localhost` EVENT `kpi_withdraw_event` ON SCHEDULE EVERY 1 DAY STARTS '2016-01-19 00:00:00' ON COMPLETION PRESERVE DISABLE DO CALL withdraw_update()$$

CREATE DEFINER=`ansaru`@`localhost` EVENT `rest_ansar_paneling_event` ON SCHEDULE EVERY 5 MINUTE STARTS '2015-11-17 21:16:43' ON COMPLETION PRESERVE ENABLE DO CALL update_panel()$$

DELIMITER ;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
